/* eslint-disable react/no-unescaped-entities */
import React from 'react';
import StadiumButton from '../../components/stadiumButton';
import '../../style/style.css';
import { useTranslation } from 'react-i18next';

function TermsAndConditionAR(props: TermsAndConditionProp) {
  const { t } = useTranslation();
  return (
    <>
      {props.showModal ? (
        <>
          <div className="justify-center items-center flex overflow-x-hidden overflow-y-auto fixed inset-0 z-50 outline-none focus:outline-none mx-2">
            <div className="relative w-auto my-6 mx-10 md:mx-auto max-w-min">
              <div className="border-0 rounded-2xl shadow-lg relative flex flex-col w-full bg-white outline-none focus:outline-none pt-14">
                {/*body*/}
                <div className="items-center">
                  <div className=" absolute right-10 top-10 ">
                    <svg
                      onClick={() => {
                        props.setShowModal(false);
                      }}
                      xmlns="http://www.w3.org/2000/svg"
                      className="h-6 w-6"
                      fill="none"
                      viewBox="0 0 24 24"
                      stroke="currentColor"
                      strokeWidth={2}
                    >
                      <path
                        strokeLinecap="round"
                        strokeLinejoin="round"
                        d="M6 18L18 6M6 6l12 12"
                      />
                    </svg>
                  </div>
                  <div className="  text-center text-2xl font-bold ">
                    {t('terms_conditions')}
                  </div>
                </div>
                <div className=" overflow-scroll-gradient text-salamblue">
                  <div className=" px-10  py-8 font-normal overflow-y-scroll h-685 leading-8 tracking-normal">
                    <h2
                      className="h4 mb-5 aos-init aos-animate text-salamblue font-medium text-xl"
                      data-aos="fade-left"
                    >
                      شروط وأحكام الاشتراك
                    </h2>
                    <h5 className="text-salamgreen leading-8 font-semibold">
                      1. تعريفات:
                    </h5>
                    <p>
                      ما لم يقتضي السياق خلاف ذلك، يكون للكلمات والمختصرات
                      التالية المعاني الموضحة أدناه:{' '}
                    </p>
                    <p>
                      "العقد" يقصد به جميع ما ورد في هذه الوثيقة واى وثيقة يشار
                      اليها وايضًا أحكام وشروط الهيئة.
                      <br /> "الهيئة" تعني هيئة الاتصالات و تقنية المعلومات في
                      المملكة العربية السعودية.
                      <br /> "الشركة او سلام" تعني شركة الاتصالات المتكاملة
                      المحدودة.
                      <br /> "المعدات" تعني المعدات اللازمة لاستقبال وتشغيل
                      الخدمة/الخدمات.
                      <br /> "الخدمة" تعني الخدمة/الخدمات التي تقدمها الشركة،
                      والتي اختارها العميل وفقًا لعقد الاشتراك.
                      <br /> "العميل" يعني الشخص الطبيعي أو الاعتباري الذي يطلب
                      الخدمة من الشركة.
                      <br /> "مدة الاشتراك" تعنى مدة التعاقد التي وافق عليها
                      العميل والمحددة في عقد الاشتراك . "عقد الاشتراك" يعني طلب
                      التعاقد لطلب الخدمة وموافقة العميل على الرسوم المتعلقة
                      بهذا العقد.
                    </p>
                    <h5 className="text-salamgreen leading-8 font-semibold pt-4">
                      2. مرجعية العقد:
                    </h5>
                    <p>
                      تخضع الخدمة / الخدمات التي تقدمها الشركة بموجب هذا العقد
                      للشروط و الأحكام الواردة في تنظيمات حماية حقوق مستخدمي
                      خدمات الاتصالات وتقنية المعلومات وشروط تقديم الخدمات يوليو
                      2020 م والمنشورة بهذا الرابط )لائحة حماية حقوق المستخدمين
                      والمعتمدة من الهيئة بالقرار رقم 1441/423 وتاريخ 1441/12/27
                      هـ ، ثم هذا العقد على التوالي.
                    </p>
                    <h5 className="text-salamgreen leading-8 font-semibold pt-4">
                      3. مدة العقد:
                    </h5>
                    <p>
                      مدة هذا العقد هي سنة واحدة مساوية لمدة الاشتراك التي وافق
                      عليها العميل في عقد الاشتراك ("المدة الاولية") والتي تبدأ
                      من تاريخ تشغيل الخدمة. ويتم تجديد هذا العقد تلقائيًا لمدد
                      مماثلة للمدة الاولية ("المدد المجددة") ما لم يتم إنهاؤها
                      على النحو المنصوص عليه في هذا العقد.
                    </p>
                    <h5 className="text-salamgreen leading-8 font-semibold pt-4">
                      4. أحكام عامة:
                    </h5>
                    <p>
                      <br /> 4.1. تستخدم الشركة بروتوكول )Dynamic Host
                      Configuration Protocol (DHCP الذي يمكنها تلقائيا من تعيين
                      بروتوكول الإنترنت (IP) للخدمة.
                      <br /> 4.2. حقوق الملكية الفكرية الخاصة بالخدمة المقدمة من
                      قبل الشركة، أو وكلائها، أو الموردون أو الشركات التابعة لها
                      أو المرخصين أو غير ذلك من قبل مالكي تلك المواد، محفوظة
                      ومحمية بموجب قوانين حقوق النشر والمعاهدات الدولية.
                      <br /> 4.3. لا يجوز للعميل إعادة بيع الخدمة، أو خلاف ذلك
                      مثل توزيع الخدمة أو أي جزء منها إلى أي طرف ثالث دون الحصول
                      على موافقة خطية من قبل الشركة حيث أن هذه الخدمة مقدمة الى
                      وحدة سكنية واحدة فقط.
                      <br /> 4.4. يحق للعميل الحصول على نسخة من هذا العقد .
                      <br /> 4.5. يعتبر العميل مسؤول مسؤولية تامة عن جميع
                      المعلومات المسجلة في هذا العقد ويتحمل العميل اي مسؤولية
                      تجاه اي معلومات خاطئة كما يتوجب على العميل اخطار الشركة
                      عند تغيير اي معلومات في هذا العقد.
                      <br /> 4.6. تلتزم الشركة بتزويد العميل بالخدمة المطلوبة
                      بعد أ( استيفاء جميع الشروط المطلوبة للخدمة ، ب( بما يتوفر
                      من الامكانيات التقنية للشركة والمتطلبات في محل تواجد
                      العميل.
                      <br /> 4.7. يكون العميل مسؤولا عن حماية الأجهزة التي
                      تقدمها الشركة ضد الفيروسات أو الرسائل الضارة التي قد تؤثر
                      على الأجهزة. وفي حالة تعطل الأجهزة بسبب سوء استخدام أو
                      إهمال العميل، يوافق العميل على دفع تعويض يعادل قيمة تصليح
                      أو استبدال الجهاز .
                      <br /> 4.8. يقر العميل بموافقته على تزويد الشركة بأي
                      معلومات تطلبها لفتح و/أو تدقيق و/أو إدارة حسابه لدى الشركة
                      ويفوض العميل الشركة بجمع كافة البيانات اللازمة أو التي
                      تخصه، أو تخص حسابه، أو اي حساب اخر يكون لدى الشركة من
                      الشركة السعودية للمعلومات الائتمانية (سمة). كما يوافق
                      العميل أن تفصح الشركة لسمة عن المعلومات الخاصة بالعميل
                      وبحسابه المذكور أو اي حساب اخر لدي الشركة بموجب اتفاقية
                      العضوية المبرمة وقواعد العمل المقرة والخاصة بتبادل
                      المعلومات و/أو لأي جهة تقرها مؤسسة النقد العربي السعودي.
                      وتقوم الشركة باستخدام خدمات أبشر لتوثيق هوية العميل
                    </p>
                    <h5 className="text-salamgreen leading-8 font-semibold pt-4">
                      5. الفواتير وطرق الدفع:
                    </h5>
                    <p>
                      <br /> 5.1. يوافق العميل على دفع جميع الرسوم والفواتير
                      لاستخدام الخدمة / الخدمات المقدمة من الشركة وفقًا لما يتم
                      تحديده في عقد الاشتراك.
                      <br /> 5.2. بالنسبة للباقات لاحقة الدفع يوافق العميل على
                      دفع مبلغ تأمين يعادل قيمة أجر اشتراك شهر قبل تفعيل الخدمة
                      وسيتم ارجاع مبلغ التأمين الى العميل في نهاية المدة الاولية
                      أو تسوية المبلغ مع قيمة أخر فاتورة في نهاية المدة الاولية.
                      ولا يحق للعميل المطالبة باسترداد مبلغ التأمين في حال
                      الانهاء المبكر للخدمة قبل اكمال المدة الاولية.
                      <br /> 5.3. يقوم العميل بدفع قيمة الاجهزة وقيمة خدمات
                      التركيب والتفعيل التي تقدمها له الشركة إما على أقساط شهرية
                      أو القيمة الكاملة بناء على نوع الخدمة ما لم تقدم الشركة
                      الجهاز وخدمات التركيب والتفعيل للعميل كجزء من عرض ترويجي
                      تقدمه الشركة وفقا لعقد الاشتراك.
                      <br /> 5.4. للشركة الحق في الإعلان عن عروض ترويجية التي قد
                      تنطبق أو لا تنطبق على هذا العقد.
                      <br /> 5.5. إذا كان العميل مشترك في خدمة الدفع التلقائي عن
                      طريق بطاقات الائتمان، فستقوم الشركة بخصم الرسوم من بطاقة
                      الائتمان الخاصة بالعميل تلقائيًا عند استحقاق رسوم الاشتراك
                      للخدمة/للخدمات المقدمة. 5.6. في حال إلغاء البطاقة
                      الائتمانية المخصصة للتسديد التلقائي، يجب على العميل
                      الاتصال بمركز خدمة العملاء (رقم 8005000000 ) أو إبلاغ اقرب
                      مكتب اشتراكات خاص بالشركة خطيا خلال مدة لا تقل عن ثلاثين
                      (30) يوما قبل هذا الإلغاء، كما يلتزم العميل بتوفير وسيلة
                      دفع بديلة مقبولة لدى الشركة.
                    </p>
                    <h5 className="text-salamgreen leading-8 font-semibold pt-4">
                      6. طلبات تعليق الخدمة أو نقلها أو إنهائها:
                    </h5>
                    <p>
                      6.1. للشركة الحق في تعليق أو إنهاء هذا العقد إذا لم يلتزم
                      العميل بأي من بنود هذا العقد أو بسبب عدم دفع الرسوم من قبل
                      العميل أو إذا طلبت الهيئة ذلك.
                      <br /> 6.2. جميع طلبات العميل للخدمات المذكورة ادناه والتي
                      يمكن الحصول عليها عن طريق الاتصال بمركز خدمة العملاء أو
                      بزيارة أحد مكاتب الشركة تخضع لدفع العميل رسوم محددة نظير
                      قيام الشركة بتنفيذها كما هو مذكور لاحقًا.
                    </p>
                    <p></p>
                    <table className="table termConditionCss text-center my-4">
                      <thead>
                        <tr className="bg-blue-600">
                          <th scope="col">#</th>
                          <th scope="col">نوع الطلب</th>
                          <th scope="col">الرسوم*</th>
                        </tr>
                      </thead>
                      <tbody>
                        <tr>
                          <th scope="row">أ</th>
                          <td>
                            نقل الخدمة (شرط وجود تغطية للشركة في المقر الجديد
                            للعميل)
                          </td>
                          <td>ريال 615</td>
                        </tr>
                        <tr>
                          <th scope="row">ب</th>
                          <td>تعليق الخدمة (حد اقصى 12 شهر)</td>
                          <td>53 ريال عن كل شهر</td>
                        </tr>
                        <tr>
                          <th scope="row">ت</th>
                          <td>
                            الانهاء المبكر للخدمة قبل نهاية مدة الاشتراك
                            للمشتركين 12 شهر
                          </td>
                          <td>130 ريال عن كل شهر متبقى من مدة الاشتراك**</td>
                        </tr>
                      </tbody>
                    </table>
                    <p></p>
                    <p>
                      * الرسوم المذكورة اعلاه لا تشمل ضريبة القيمة المضافة.
                      <br /> ** هذا المبلغ تم احتسابه بناء على عرض حصول العميل
                      على رسوم التركيب والتفعيل (900 ريال) اضافة الى قيمة
                      المودم(660 ريال) ضمن قيمة الاشتراك الشهري بشرط اكمال مدة
                      الاشتراك.
                    </p>
                    <h5 className="text-salamgreen leading-8 font-semibold pt-4">
                      7. حدود الضمان والمسؤولية:
                    </h5>
                    <p>
                      <br /> 7.1. ما لم ينص صراحة على غير ذلك في الشروط الواردة
                      في هذا العقد وشروط الخدمة المعتمدة من قبل هيئة الاتصالات
                      وتقنية المعلومات فإنه:
                      <br />
                      7.1.1. بموجب هذه الاتفاقية لا تقدم الشركة اي تعهدات أو
                      ضمانات سواء كانت علنية أو ضمنية بما فيها (1) عدم انتهاك
                      الحقوق الشخصية للمشترك أو أية إطراف أخرى، (2) حماية العميل
                      من أخطار الإنترنت و الاختراقات، (3) ملائمة الخدمات المقدمة
                      بموجب هذه العقد لإغراض أخرى.
                      <br />
                      7.1.2. الشركة غير مسئولة عن أي خسائر مباشرة أو غير مباشرة
                      أو عرضية ،أو أية خسارة غير متوقعة ناتجة من انقطاع الخدمة
                      التي يمكن أن يتعرض لها العميل.
                      <br />
                      7.1.3. الشركة غير مسؤولة عن ضعف الخدمة داخل المنزل بسبب
                      وجود عوازل.
                    </p>
                    <h5 className="text-salamgreen leading-8 font-semibold pt-4">
                      8. مجمل الاتفاق:
                    </h5>
                    <p>
                      8.1. هذا العقد يشكل اتفاق كامل بين الشركة والعميل.
                      <br /> 8.2. في حال نشوء أي تعارض ما بين النّص الإنجليزي
                      والعربي، يكون النّص العربي لهذا العقد هو النّص المعتمد
                      والقانوني والذي يجب الرجوع إليه.
                    </p>
                    <h5 className="mt-5">
                      بتوقيع هذا العقد يوافق العميل بهذه الشروط والأحكام التي
                      تنظم العلاقة بين العميل والشركة ويقر العميل بحصوله على
                      نسخه من هذا العقد.
                    </h5>
                  </div>
                </div>
                <div className=" self-center  mx-10 mb-7 mt-5">
                  <div className="w-64">
                    <StadiumButton
                      text={t('yes_accept')}
                      onClick={() => props.onClick(true)}
                    ></StadiumButton>
                  </div>
                </div>
              </div>
            </div>
          </div>
          <div className="opacity-25 fixed inset-0 z-40 bg-black"></div>
        </>
      ) : null}
    </>
  );
}
type TermsAndConditionProp = {
  showModal: boolean;
  setShowModal: (show: boolean) => void;
  dialogText: string;
  onClick: (isAgreed: boolean) => void;
};

export default TermsAndConditionAR;
